"""
Функция count_iterable()
Реализуйте функцию count_iterable() с использованием генераторных выражений, которая принимает один аргумент:

iterable — итерируемый объект
Функция должна возвращать единственное число — количество элементов итерируемого объекта iterable.

Примечание 1. Гарантируется, что передаваемый в функцию итерируемый объект является конечным.

https://stepik.org/lesson/640049/step/17?unit=636569
"""


def cubes_of_odds(iterable):
    pass



print(count_iterable([1, 2, 3, 4, 5]))